---
kind: type
id: T:Autodesk.Revit.Exceptions.ArgumentOutOfRangeException
source: html/60f148c9-ece0-a6bb-4e12-bb4a9c8c8a24.htm
---
# Autodesk.Revit.Exceptions.ArgumentOutOfRangeException

The exception that is thrown when the value of an argument is outside the allowable range of values as defined by the invoked method.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class ArgumentOutOfRangeException : ArgumentException
```